Tekla Open API Reference for Tekla Structures 2025
MaterialSelectionForm Constructor (List<MaterialItem>)
 Creates a new instance of the MaterialSelectionForm.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public MaterialSelectionForm(
	List<MaterialItem> Materials
)
Public Sub New (
	Materials As List(Of MaterialItem)
)
Parameters
Materials
Type: System.Collections.Generic.List<MaterialItem>
The materials to be added to the dialog.
See Also
Reference
MaterialSelectionForm Class
MaterialSelectionForm Overload
Tekla.Structures.Dialog.UIControls Namespace